# coding: utf-8
ERROR_MAP = {
    # system error
    10000001: u"参数不正确",
    10000002: u"服务器内部错误",
    10000003: u"权限不足",
    # account error
    10000011: u"账户已经存在",
    10000012: u"账户不存在",
    10000013: u"密码不正确",
    10000014: u"当前不在填报的时间段内",
    10000015: u"数据信息需要先保存",
    10000016: u"信息已经上报，不能修改",
    10000017: u"删除对象不存在",
    10000018: u"更改对象不存在",
    10000019: u"当前企业无审核通过信息",
    10000020: u"对象id不存在",
    10000021: u"企业信息未填写",
    10000022: u"该信息已经被修改"
    # info error
    # data error
    # functional error code:

}
